import { body } from "express-validator";

export const validateUserLogin = [
  body("email")
    .notEmpty().withMessage("البريد الإلكتروني مطلوب")
    .isEmail().withMessage("صيغة البريد الإلكتروني غير صحيحة"),

  body("password")
    .notEmpty().withMessage("كلمة المرور مطلوبة")
    .isLength({ min: 8 }).withMessage("كلمة المرور يجب أن تكون 8 أحرف على الأقل"),

  body("grade")
    .notEmpty().withMessage("الصف الدراسي مطلوب")
    .isIn([
      "الصف الأول الابتدائي",
      "الصف الثاني الابتدائي", 
      "الصف الثالث الابتدائي",
      "الصف الرابع الابتدائي",
      "الصف الخامس الابتدائي",
      "الصف السادس الابتدائي",
      "الصف الأول الإعدادي",
      "الصف الثاني الإعدادي",
      "الصف الثالث الإعدادي",
      "الصف الأول الثانوي",
      "الصف الثاني الثانوي",
      "الصف الثالث الثانوي",
      "جامعي",
      "معلم"
    ]).withMessage("يرجى اختيار صف دراسي صحيح"),
];
